# customer-processor - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer_processor_identity_v1_event]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_processor]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 1s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer_processor_identity_v1_event-20230516121033728100000001]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-450d6976-4808-49d5-a408-04cc68a55ebc]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=b18ffd3e4cbe812e076fb896621aa09a8ce561c6]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=customer_processor_identity_v1_event]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.aws_lambda_event_source_mapping.kafka_trigger will be created
  + resource "aws_lambda_event_source_mapping" "kafka_trigger" {
      + enabled                       = true
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:064003852748:function:customer_processor_identity_v1_event/invocations"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "TRIM_HORIZON"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + topics                        = [
          + "identity.v1.event",
        ]
      + uuid                          = (known after apply)

      + self_managed_event_source {
          + endpoints = {
              + "KAFKA_BOOTSTRAP_SERVERS" = "fast-anteater-6016-us1-kafka.upstash.io:9092"
            }
        }
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_processor_identity_v1_event"
        tags                           = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "fast-anteater-6016-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "677ab0ecb97b47f885d236ad095d2dce"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "ZmFzdC1hbnRlYXRlci02MDE2JIMxGX-WLd9KubI1dJqBcDG6YO8ZpXdOzsH8K50"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_processor"
        name       = "customer_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "f41f7cb2-6939-4738-a743-d2f66f024fd1" -> "a03368c1-7c32-475b-948c-10635e56ed42"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*